## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # zentral_mdm_artifact.mscp-firewall will be created
  + resource "zentral_mdm_artifact" "mscp-firewall" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "mSCP - firewall"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_profile.mscp-firewall-1 will be created
  + resource "zentral_mdm_profile" "mscp-firewall-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+Q29uc2VudFRleHQ8L2tleT4KCTxkaWN0PgoJCTxrZXk+ZGVmYXVsdDwva2V5PgoJCTxzdHJpbmc+VEhFIFNPRlRXQVJFIElTIFBST1ZJREVEICdBUyBJUycgV0lUSE9VVCBBTlkgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVJVEhFUiBFWFBSRVNTRUQsIElNUExJRUQsIE9SIFNUQVRVVE9SWSwgSU5DTFVESU5HLCBCVVQgTk9UIExJTUlURUQgVE8sIEFOWSBXQVJSQU5UWSBUSEFUIFRIRSBTT0ZUV0FSRSBXSUxMIENPTkZPUk0gVE8gU1BFQ0lGSUNBVElPTlMsIEFOWSBJTVBMSUVEIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLCBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSwgQU5EIEZSRUVET00gRlJPTSBJTkZSSU5HRU1FTlQsIEFORCBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgRE9DVU1FTlRBVElPTiBXSUxMIENPTkZPUk0gVE8gVEhFIFNPRlRXQVJFLCBPUiBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgU09GVFdBUkUgV0lMTCBCRSBFUlJPUiBGUkVFLiAgSU4gTk8gRVZFTlQgU0hBTEwgTklTVCBCRSBMSUFCTEUgRk9SIEFOWSBEQU1BR0VTLCBJTkNMVURJTkcsIEJVVCBOT1QgTElNSVRFRCBUTywgRElSRUNULCBJTkRJUkVDVCwgU1BFQ0lBTCBPUiBDT05TRVFVRU5USUFMIERBTUFHRVMsIEFSSVNJTkcgT1VUIE9GLCBSRVNVTFRJTkcgRlJPTSwgT1IgSU4gQU5ZIFdBWSBDT05ORUNURUQgV0lUSCBUSElTIFNPRlRXQVJFLCBXSEVUSEVSIE9SIE5PVCBCQVNFRCBVUE9OIFdBUlJBTlRZLCBDT05UUkFDVCwgVE9SVCwgT1IgT1RIRVJXSVNFLCBXSEVUSEVSIE9SIE5PVCBJTkpVUlkgV0FTIFNVU1RBSU5FRCBCWSBQRVJTT05TIE9SIFBST1BFUlRZIE9SIE9USEVSV0lTRSwgQU5EIFdIRVRIRVIgT1IgTk9UIExPU1MgV0FTIFNVU1RBSU5FRCBGUk9NLCBPUiBBUk9TRSBPVVQgT0YgVEhFIFJFU1VMVFMgT0YsIE9SIFVTRSBPRiwgVEhFIFNPRlRXQVJFIE9SIFNFUlZJQ0VTIFBST1ZJREVEIEhFUkVVTkRFUi48L3N0cmluZz4KCTwvZGljdD4KCTxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KCTxhcnJheT4KCQk8ZGljdD4KCQkJPGtleT5FbmFibGVGaXJld2FsbDwva2V5PgoJCQk8dHJ1ZS8+CgkJCTxrZXk+RW5hYmxlTG9nZ2luZzwva2V5PgoJCQk8dHJ1ZS8+CgkJCTxrZXk+RW5hYmxlU3RlYWx0aE1vZGU8L2tleT4KCQkJPHRydWUvPgoJCQk8a2V5PkxvZ2dpbmdPcHRpb248L2tleT4KCQkJPHN0cmluZz5kZXRhaWw8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJCQk8c3RyaW5nPmFsYWNhcnRlLm1hY09TLjgwMC01M3I1X21vZGVyYXRlLjRkMTk4ODcxLTBlMTYtNDdmYy1iZDM5LTRlMTBmNmQyOTdmNjwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRUeXBlPC9rZXk+CgkJCTxzdHJpbmc+Y29tLmFwcGxlLnNlY3VyaXR5LmZpcmV3YWxsPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCQkJPHN0cmluZz40ZDE5ODg3MS0wZTE2LTQ3ZmMtYmQzOS00ZTEwZjZkMjk3ZjY8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJCQk8aW50ZWdlcj4xPC9pbnRlZ2VyPgoJCTwvZGljdD4KCTwvYXJyYXk+Cgk8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5PgoJPHN0cmluZz5DcmVhdGVkOiAyMDI0LTA3LTA5CkNvbmZpZ3VyYXRpb24gc2V0dGluZ3MgZm9yIHRoZSBjb20uYXBwbGUuc2VjdXJpdHkuZmlyZXdhbGwgcHJlZmVyZW5jZSBkb21haW4uPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5PgoJPHN0cmluZz5bODAwLTUzcjVfbW9kZXJhdGVdIGNvbS5hcHBsZS5zZWN1cml0eS5maXJld2FsbCBzZXR0aW5nczwvc3RyaW5nPgoJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJPHN0cmluZz5jb20uYXBwbGUuc2VjdXJpdHkuZmlyZXdhbGwuODAwLTUzcjVfbW9kZXJhdGU8L3N0cmluZz4KCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJPHN0cmluZz5tYWNPUyBTZWN1cml0eSBDb21wbGlhbmNlIFByb2plY3Q8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+Cgk8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVHlwZTwva2V5PgoJPHN0cmluZz5Db25maWd1cmF0aW9uPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRVVUlEPC9rZXk+Cgk8c3RyaW5nPmMxMGYxYWMzLTQyNjQtNDcxYi04ZWNkLWFhOGIxYzY2MjdjZjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJPGludGVnZXI+MTwvaW50ZWdlcj4KPC9kaWN0Pgo8L3BsaXN0Pgo="
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_acls_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_control_acls_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_control_acls_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = "/etc/security/audit_control _MUST_ not contain Access Control Lists (ACLs)." -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "0" -> null
      - id               = 186 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure Audit_Control to Not Contain Access Control Lists" -> null
      - source           = "/bin/ls -le /etc/security/audit_control | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \":\"" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_group_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_control_group_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_control_group_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = "/etc/security/audit_control _MUST_ have the group set to wheel." -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "0" -> null
      - id               = 181 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure Audit_Control Group to Wheel" -> null
      - source           = "/bin/ls -dn /etc/security/audit_control | /usr/bin/awk '{print $4}'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_mode_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_control_mode_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_control_mode_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = "/etc/security/audit_control _MUST_ be configured so that it is readable only by the root user and group wheel." -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "0" -> null
      - id               = 163 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure Audit_Control Owner to Mode 440 or Less Permissive" -> null
      - source           = "/bin/ls -l /etc/security/audit_control | /usr/bin/awk '!/-r--[r-]-----|current|total/{print $1}' | /usr/bin/wc -l | /usr/bin/xargs" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_owner_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_control_owner_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_control_owner_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = "/etc/security/audit_control _MUST_ have the owner set to root." -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "0" -> null
      - id               = 190 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure Audit_Control Owner to Root" -> null
      - source           = "/bin/ls -dn /etc/security/audit_control | /usr/bin/awk '{print $3}'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_failure_halt will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_failure_halt" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit service _MUST_ be configured to shut down the computer if it is unable to audit system events.
            
            Once audit failure occurs, user and system activity are no longer recorded, and malicious activity could go undetected. Audit processing failures can occur due to software/hardware errors, failures in the audit capturing mechanisms, and audit storage capacity being reached or exceeded.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Shut Down Upon Audit Failure"
      + source           = "/usr/bin/awk -F':' '/^policy/ {print $NF}' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec 'ahlt'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_aa_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_aa_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The auditing system _MUST_ be configured to flag authorization and authentication (aa) events.
            
            Authentication events contain information about the identity of a user, server, or client. Authorization events contain information about permissions, rights, and rules. If audit records do not include aa events, it is difficult to identify incidents and to correlate incidents to subsequent events.
            
            Audit records can be generated from various components within the information system (e.g., via a module or policy filter).
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Authorization and Authentication Events"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec 'aa'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_ad_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_ad_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The auditing system _MUST_ be configured to flag administrative action (ad) events.
            
            Administrative action events include changes made to the system (e.g. modifying authentication policies). If audit records do not include ad events, it is difficult to identify incidents and to correlate incidents to subsequent events.
            
            Audit records can be generated from various components within the information system (e.g., via a module or policy filter).
            
            The information system audits the execution of privileged functions.
            
            NOTE: We recommend changing the line "43127:AUE_MAC_SYSCALL:mac_syscall(2):ad" to "43127:AUE_MAC_SYSCALL:mac_syscall(2):zz" in the file /etc/security/audit_event. This will prevent sandbox violations from being audited by the ad flag.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Administrative Action Events"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec 'ad'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_ex_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_ex_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of access restrictions, including failed program execute (-ex) attempts.
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized access and/or changes to configuration settings. One common and effective enforcement action method is using program execution restrictions (e.g., denying users access to execute certain processes).
            
            This configuration ensures that audit lists include events in which program execution has failed.
            Without auditing the enforcement of program execution, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Failed Program Execution on the System"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-ex'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fd_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fd_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of attempts to delete file attributes (fd).
            
            ***Enforcement actions are the methods or mechanisms used to prevent unauthorized changes to configuration settings. One common and effective enforcement action method is using access restrictions (i.e., denying modifications to a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to delete a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Deletions of Object Attributes"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fd'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fm_failed_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fm_failed_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of failed attempts to modify file attributes (-fm).
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized changes to configuration settings. One common and effective enforcement action method is using access restrictions (i.e., denying modifications to a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to modify a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Failed Change of Object Attributes"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fm'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fr_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fr_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of access restrictions, including failed file read (-fr) attempts.
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized access and/or changes to configuration settings. One common and effective enforcement action method is using access restrictions (e.g., denying access to a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to read a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Failed Read Actions on the System"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fr'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fw_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fw_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of access restrictions, including failed file write (-fw) attempts.
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized access and/or changes to configuration settings. One common and effective enforcement action method is using access restrictions (e.g., denying users access to edit a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to change a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Failed Write Actions on the System"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fw'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_lo_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_flags_lo_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit system _MUST_ be configured to record all attempts to log in and out of the system (lo).
            
            Frequently, an attacker that successfully gains access to a system has only gained access to an account with limited privileges, such as a guest account or a service account. The attacker must attempt to change to another user account with normal or elevated privileges in order to proceed. Auditing both successful and unsuccessful attempts to switch to another user account (by way of monitoring login and logout events) mitigates this risk.
            
            The information system monitors login and logout events.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure System to Audit All Log In and Log Out Events"
      + source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '^lo'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_settings_failure_notify will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_settings_failure_notify" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit service _MUST_ be configured to immediately print messages to the console or email administrator users when an auditing failure occurs.
            
            It is critical for the appropriate personnel to be made aware immediately if a system is at risk of failing to process audit logs as required. Without a real-time alert, security personnel may be unaware of a potentially harmful failure in the auditing system's capability, and system operation may be adversely affected.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Failure Notification"
      + source           = "/usr/bin/grep -c \"logger -s -p\" /etc/security/audit_warn"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-authentication-auth_pam_login_smartcard_enforce will be created
  + resource "zentral_munki_script_check" "mcs-authentication-auth_pam_login_smartcard_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The system _MUST_ be configured to enforce multifactor authentication.
            
            All users _MUST_ go through multifactor authentication to prevent unauthenticated access and potential compromise to the system.
            
            IMPORTANT: Modification of Pluggable Authentication Modules (PAM) now require user authorization, or use of a Privacy Preferences Policy Control (PPPC) profile from MDM that authorizes modifying system administrator files or full disk access.
            
            NOTE: /etc/pam.d/login will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "2"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Authentication - Enforce Multifactor Authentication for Login"
      + source           = "/usr/bin/grep -Ec '^(auth\\s+sufficient\\s+pam_smartcard.so|auth\\s+required\\s+pam_deny.so)' /etc/pam.d/login"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-authentication-auth_pam_su_smartcard_enforce will be created
  + resource "zentral_munki_script_check" "mcs-authentication-auth_pam_su_smartcard_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The system _MUST_ be configured such that, when the su command is used, multifactor authentication is enforced.
            
            All users _MUST_ go through multifactor authentication to prevent unauthenticated access and potential compromise to the system.
            
            IMPORTANT: Modification of Pluggable Authentication Modules (PAM) now require user authorization, or use of a Privacy Preferences Policy Control (PPPC) profile from MDM that authorizes modifying system administrator files or full disk access.
            
            NOTE: /etc/pam.d/su will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "2"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Authentication - Enforce Multifactor Authentication for the su Command"
      + source           = "/usr/bin/grep -Ec '^(auth\\s+sufficient\\s+pam_smartcard.so|auth\\s+required\\s+pam_rootok.so)' /etc/pam.d/su"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-authentication-auth_pam_sudo_smartcard_enforce will be created
  + resource "zentral_munki_script_check" "mcs-authentication-auth_pam_sudo_smartcard_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The system _MUST_ be configured to enforce multifactor authentication when the sudo command is used to elevate privilege.
            
            All users _MUST_ go through multifactor authentication to prevent unauthenticated access and potential compromise to the system.
            
            IMPORTANT: Modification of Pluggable Authentication Modules (PAM) now require user authorization, or use of a Privacy Preferences Policy Control (PPPC) profile from MDM that authorizes modifying system administrator files or full disk access.
            
            NOTE: /etc/pam.d/sudo will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "2"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Authentication - Enforce Multifactor Authentication for Privilege Escalation Through the sudo Command"
      + source           = "/usr/bin/grep -Ec '^(auth\\s+sufficient\\s+pam_smartcard.so|auth\\s+required\\s+pam_deny.so)' /etc/pam.d/sudo"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-authentication-auth_smartcard_allow will be created
  + resource "zentral_munki_script_check" "mcs-authentication-auth_smartcard_allow" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Smartcard authentication _MUST_ be allowed.
            
            The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.
            
            When enabled, the smartcard can be used for login, authorization, and screen saver unlocking.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "true"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Authentication - Allow Smartcard Authentication"
      + source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
            .objectForKey('allowSmartCard').js
            EOS
        EOT
      + tag_ids          = (known after apply)
      + type             = "ZSH_STR"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-authentication-auth_smartcard_certificate_trust_enforce_moderate will be created
  + resource "zentral_munki_script_check" "mcs-authentication-auth_smartcard_certificate_trust_enforce_moderate" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The macOS system _MUST_ be configured to block access to users who are no longer authorized (i.e., users with revoked certificates).
            
            To prevent the use of untrusted certificates, the certificates on a smartcard card _MUST_ meet the following criteria: its issuer has a system-trusted certificate, the certificate is not expired, its "valid-after" date is in the past, and it passes Certificate Revocation List (CRL) and Online Certificate Status Protocol (OCSP) checking.
            
            By setting the smartcard certificate trust level to moderate, the system will execute a soft revocation, i.e., if the OCSP/CRL server is unreachable, authentication will still succeed.
            
            NOTE: Before applying this setting, please see the smartcard supplemental guidance.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "2"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Authentication - Set Smartcard Certificate Trust to Moderate"
      + source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
            .objectForKey('checkCertificateTrust').js
            EOS
        EOT
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-authentication-auth_smartcard_enforce will be created
  + resource "zentral_munki_script_check" "mcs-authentication-auth_smartcard_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Smartcard authentic
--- TRUNCATED ---
```
</details>